Revit 2026 API

# SpatialElementTagTagText Property

---

The text displayed by the tag.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string TagText { get; }
```
```vb
Public ReadOnly Property TagText As String
	Get
```
```cpp
public:
property String^ TagText {
	String^ get ();
}
```
```fsharp
member TagText : string with get
```

#### Property Value

String

If there are several strings included in the tag, the strings will be returned concatenated.

#### Reference

SpatialElementTag Class

Autodesk.Revit.DB Namespace